{"id":66,"date":"2016-11-10T18:38:56","date_gmt":"2016-11-10T18:38:56","guid":{"rendered":"https:\/\/www.matchsourcing.com\/?page_id=66"},"modified":"2021-08-24T17:28:24","modified_gmt":"2021-08-24T09:28:24","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/www.matchsourcing.com\/privacy-policy","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<p>MatchSourcing respects the privacy needs and concerns of our customers. How we handle any personal information, such as your name, address, email address or phone number (&#8220;Personal Information&#8221;) that you provide to us is important to us.<\/p>\n<p>This Privacy Policy describes the Personal Information we gather about you, what we do with it, the safeguards we have in place to protect it, and how you can control our use of it. By using our website, the user agrees, without limitation or qualification, to be bound by this Privacy Statement.<\/p>\n<p><strong>Privacy Policy<\/strong><br \/>\nWhen you provide Personal Information online you are consenting to the manner in which MatchSourcing will collect, use, disclose and otherwise manage your Personal Information, as set out below.<\/p>\n<p><strong>Who May Use the Site<\/strong><br \/>\nThe website is not intended or designed to attract users under the age of 18. We do not collect Personal Information from any person we know to be under the age of 18. If you are under 18, please do not send us any Personal Information.<\/p>\n<p><strong>Collection and Use of Personal Information<\/strong><br \/>\nWe may collect Personal Information that you provide us when you:<br \/>\n* Visit or register with our website or participate in another feature of our website.<br \/>\n* Provide us with comments or suggestions.<\/p>\n<p><strong>What do we use your information for?<\/strong><br \/>\nAny of the information we collect from you may be used in one of the following ways:<\/p>\n<p>To personalize your experience<br \/>\nYour information helps us to better respond to your individual needs.<br \/>\nTo improve customer service<br \/>\nYour information helps us to more effectively respond to your customer service requests and support needs.<br \/>\nTo process transactions<br \/>\nYour information, whether public or private, will not be sold, exchanged, transferred, or given to any other company for any reason whatsoever, without your consent, other than for the express purpose of delivering the purchased product or service requested.<br \/>\nTo send periodic emails<br \/>\nThe email address you provide will be used to send you information and updates pertaining to your order or request. From time to time, MatchSourcing may contact you with valuable information that relates to services offered by our company or to offer relevant trade information that we believe you will find helpful.<\/p>\n<p>Note: If at any time you would like to unsubscribe from receiving future emails, we include detailed unsubscribe instructions at the bottom of each email.<\/p>\n<p><strong>How do we protect your information?<\/strong><br \/>\nWe implement a variety of security measures to maintain the safety of your personal information when you enter, submit, or access your personal information.<\/p>\n<p><strong>Do we disclose any information to outside parties?<\/strong><br \/>\nWe do not sell, trade, or otherwise, transfer to outside parties your personally identifiable information. This does not include trusted third parties who assist us in operating our website, conducting our business, or servicing you, so long as those parties agree to keep this information confidential. We may also release your information when we believe release is appropriate to comply with the law, enforce our site policies, or protect ours or others rights, property, or safety. However, non-personally identifiable visitor information may be provided to other parties for marketing, advertising, or other uses.<\/p>\n<p><strong>Third party links<\/strong><br \/>\nOccasionally, at our discretion, we may include or offer third party products or services on our website. These third party sites have separate and independent privacy policies. We, therefore, have no responsibility or liability for the content and activities of these linked sites. Nonetheless, we seek to protect the integrity of our site and welcome any feedback about these sites.<\/p>\n<p><strong>Sale of Business<\/strong><br \/>\nIn the event that MatchSourcing or some of our assets are sold or transferred or used as security, your Personal Information may be transferred to third parties as part of that transaction.<\/p>\n<p>If your purchases or items are being shipped to you, your shipping information will be shared with our delivery service providers. Our delivery service providers are asked not to use your Personal Information for any purpose other than making the delivery.<\/p>\n<p><strong>Privacy Statement Modifications<\/strong><br \/>\nFrom time to time, we may modify or amend this Privacy Statement in order to comply with new laws or regulations or to reflect future changes in our business practices. Any changes in our policies will be communicated on this page so please check back on occasion.<\/p>\n<p><strong>Contacting Us<\/strong><br \/>\nIf you have any questions about our handling of Personal Information, please contact us at:<br \/>\ninfo@matchsourcing.com<\/p>\n","protected":false},"excerpt":{"rendered":"<p>MatchSourcing respects the privacy needs and concerns of our customers. How we handle any personal information, such as your name, address, email address or phone number (&#8220;Personal Information&#8221;) that you provide to us is important to us. This Privacy Policy describes the Personal Information we gather about you, what we do with it, the safeguards [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/pages\/66"}],"collection":[{"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/comments?post=66"}],"version-history":[{"count":3,"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/pages\/66\/revisions"}],"predecessor-version":[{"id":71,"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/pages\/66\/revisions\/71"}],"wp:attachment":[{"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/media?parent=66"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}