{"id":69,"date":"2016-11-10T18:43:29","date_gmt":"2016-11-10T18:43:29","guid":{"rendered":"https:\/\/www.matchsourcing.com\/?page_id=69"},"modified":"2022-11-14T21:33:52","modified_gmt":"2022-11-14T13:33:52","slug":"terms-of-service","status":"publish","type":"page","link":"https:\/\/www.matchsourcing.com\/terms-of-service","title":{"rendered":"Terms of Service"},"content":{"rendered":"<p>Please read these Terms of Services carefully before using the www.matchsourcing.com website (the “Service”) operated by MatchSourcing (“us”, “we”, or “our”).<\/p>\n<p>By accessing or using the Service you agree to be bound by these Terms. If you disagree with any part of the terms then you do not have permission to access the Service. These Terms of Use describe the terms by which MatchSourcing offers you access to this website and the content and services offered on it. In consideration of MatchSourcing granting you access to the Website, you represent that you have read and understand each of the terms and conditions of these Terms of Services and agree that these Terms of Services govern your use of the Website. If you do not agree to accept these Terms of Services, you may not access or otherwise use the Website.<\/p>\n<p>MatchSourcing may revise these Terms of Services from time to time by posting the revised terms on the Website, with the revised terms taking effect as of the date posted. Your continued or repeated use of the Website indicates your agreement to be bound by such revised Terms of Use.<br \/>\n<strong><br \/>\nPurchases<\/strong><br \/>\nIf you wish to purchase any product or service made available through the Service, you may be asked to supply certain information relevant to your Purchase including, without limitation, your credit card number, the expiration date of your credit card, your billing address, your shipping information and any other information necessary to process your purchase.<\/p>\n<p>You represent and warrant that:<br \/>\n(i) you have the legal right to use any credit card(s) or other payment method(s) in connection with any Purchase; and that (ii) the information you supply to us is true, correct and complete.<\/p>\n<p>The Service may employ the use of third party services for the purpose of facilitating payment and the completion of Purchases. By submitting your information, you grant us the right to provide the information to these third parties subject to our Privacy Policy.<\/p>\n<p>We reserve the right to refuse or cancel your order at any time for reasons including but not limited to product or service availability, errors in the description or price of the product or service, error in your order or other reasons.<\/p>\n<p>We reserve the right to refuse or cancel your order if fraud or an unauthorized or illegal transaction is suspected.<\/p>\n<p><strong>Availability, Errors, and Inaccuracies<\/strong><\/p>\n<p>We are constantly updating product and service offerings on the Service. We may experience delays in updating information on the Service and in our advertising on other websites. The information found on the Service may contain errors or inaccuracies and may not be complete or current. Products or services may be mispriced, described inaccurately, or unavailable on the Service and we cannot guarantee the accuracy or completeness of any information found on the Service.<\/p>\n<p>We, therefore, reserve the right to change or update information and to correct errors, inaccuracies, or omissions at any time without prior notice and without prejudice.<\/p>\n<p><strong>Links To Other Web Sites<\/strong><br \/>\nOur Service may contain links to third-party websites or services that are not owned or controlled by MatchSourcing.<br \/>\nMatchSourcing has no control over and assumes no responsibility for the content, privacy policies, or practices of any third party websites or services. We do not warrant the offerings of any of these entities\/individuals or their websites.<\/p>\n<p>You acknowledge and agree that MatchSourcing shall not be responsible or liable, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any such content, goods or services available on or through any such third party websites or services.<\/p>\n<p>We strongly advise you to read the terms and conditions and privacy policies of any third-party websites or services that you visit.<\/p>\n<p><strong>Termination<\/strong><br \/>\nWe may terminate or suspend your access to the Service immediately, without prior notice or liability, in our sole discretion, for any reason whatsoever and without limitation, including but not limited to a breach of the Terms.<\/p>\n<p>All provisions of the Terms which, by their nature, should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity and limitations of liability.<\/p>\n<p><strong>Indemnification<\/strong><br \/>\nYou agree to defend, indemnify and hold harmless MatchSourcing and its licensee and licensors, and their employees, contractors, agents, officers and directors, from and against any and all claims, damages, obligations, losses, liabilities, costs or debt, and expenses, including but not limited to attorney’s fees, resulting from or arising out of a) your use and access of the Service or b) a breach of these Terms.<\/p>\n<p><strong>Limitation Of Liability<\/strong><br \/>\nYou acknowledge and agree that MatchSourcing and licensors, and their employees, contractors, agents, officers, and directors, are serving as a consultant only. By entering into this agreement with MatchSourcing, its employees, contractors, agents, officers and directors, you agree that the total liability arising from their performance of this agreement, including errors or omissions, shall not exceed MatchSourcing’s total fees charged to you for the services rendered on the project. In no event shall MatchSourcing, nor its directors, employees, partners, agents, suppliers, or affiliates, be liable for any direct, indirect, incidental, special, consequential or punitive damages, including without limitation, injury, damages, loss of profits, data, use, goodwill, or other intangible losses, resulting from<\/p>\n<ul>\n<li>any conduct or content of any third party involved with the Service;<\/li>\n<li>your access to or use of or inability to access or use the Service;<\/li>\n<li>any content, product, or goods obtained from the Service; and<\/li>\n<li>unauthorized access, use or alteration of your transmissions or content, whether based on warranty, contract, tort (including negligence) or any other legal theory, whether or not we have<\/li>\n<\/ul>\n<p>been informed of the possibility of such damage, and even if a remedy set forth herein is found to have failed of its essential purpose.<br \/>\nDisclaimer<br \/>\nYour use of the Service is at your sole risk. The Service is provided on an “AS-IS[Inserted: -]” and “AS-AVAILABLE” basis. The Service is provided without warranties of any kind, whether express or implied, including, but not limited to, implied warranties of merchantability, fitness for a particular purpose, non-infringement or course of performance.<br \/>\nMatchSourcing’s subsidiaries, affiliates, and its licensors do not warrant that<br \/>\na)the products sourced are free of a defect;<br \/>\nb)the Service will function uninterrupted, secure or available at any particular time or location;<br \/>\nc)any errors or defects will be corrected;<br \/>\nd)the Service is free of viruses or other harmful components;<br \/>\nor e) the results of using the Service will meet your requirements.<\/p>\n<p>The nature of the Service is such that you, in your sole determination, decide what product to source, where and by whom it will be manufactured, and any and all other decisions made with respect to the product. MatchSourcing is providing you with a Service to enable you to best make those decisions.<\/p>\n<p><strong>Changes<\/strong><br \/>\nWe reserve the right, at our sole discretion, to modify or replace these Terms at any time. By continuing to access or use our Service after any revisions become effective, you agree to be bound by the revised terms. If you do not agree to the new terms, you are no longer authorized to use the Service.<br \/>\n<strong><br \/>\nContact Us<\/strong><br \/>\nIf you have any questions about these Terms, please contact us at:<br \/>\ninfo@matchsourcing.com<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Please read these Terms of Services carefully before using the www.matchsourcing.com website (the “Service”) operated by MatchSourcing (“us”, “we”, or “our”). By accessing or using the Service you agree to be bound by these Terms. If you disagree with any part of the terms then you do not have permission to access the Service. These [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/pages\/69"}],"collection":[{"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/comments?post=69"}],"version-history":[{"count":4,"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/pages\/69\/revisions"}],"predecessor-version":[{"id":18549,"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/pages\/69\/revisions\/18549"}],"wp:attachment":[{"href":"https:\/\/www.matchsourcing.com\/wp-json\/wp\/v2\/media?parent=69"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}